; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-8-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p1-3 - location
	p2-3 - location
	p3-4 - location
	p4-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s4)
	(at driver4 s3)
	(at driver5 s2)
	(at driver6 s4)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s3)
	(empty truck7)
	(at truck8 s4)
	(empty truck8)
	(at package1 s3)
	(at package2 s0)
	(at package3 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(link s0 s3)
	(link s3 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s1)
	(link s1 s3)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s2)
	(at driver4 s1)
	(at driver6 s0)
	(at truck2 s2)
	(at truck3 s2)
	(at truck4 s1)
	(at truck5 s0)
	(at truck7 s4)
	(at truck8 s3)
	(at package1 s0)
	(at package2 s0)
	(at package3 s1)
	))


)

; plan
1. (board-truck driver1 s4 truck2)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 13
2. (board-truck driver2 s3 truck3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 1 of 13
3. (drive-truck driver1 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 2 of 13
4. (load-truck s2 package3 truck2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   goals met: 2 of 13
5. (drive-truck driver1 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 1 of 13
6. (unload-truck s1 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 2 of 13
7. (drive-truck driver2 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 2 of 13
8. (board-truck driver4 s3 truck5)
   deleted: (at driver4 s3) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 2 of 13
9. (drive-truck driver2 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 3 of 13
10. (disembark-truck driver2 s2 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 4 of 13
11. (load-truck s3 package1 truck5)
   deleted: (at package1 s3)
   added: (in package1 truck5)
   goals met: 4 of 13
12. (board-truck driver3 s4 truck8)
   deleted: (at driver3 s4) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 4 of 13
13. (drive-truck driver3 s4 s3 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s3)
   goals met: 5 of 13
14. (disembark-truck driver3 s3 truck8)
   deleted: (driving driver3 truck8)
   added: (at driver3 s3) (empty truck8)
   goals met: 5 of 13
15. (board-truck driver3 s3 truck7)
   deleted: (at driver3 s3) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 5 of 13
16. (drive-truck driver3 s3 s4 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   goals met: 6 of 13
17. (drive-truck driver4 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 7 of 13
18. (unload-truck s0 package1 truck5)
   deleted: (in package1 truck5)
   added: (at package1 s0)
   goals met: 8 of 13
19. (disembark-truck driver4 s0 truck5)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 8 of 13
20. (board-truck driver4 s0 truck4)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 8 of 13
21. (drive-truck driver4 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 8 of 13
22. (drive-truck driver4 s3 s1 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   goals met: 9 of 13
23. (disembark-truck driver4 s1 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 10 of 13
24. (walk driver6 s4 p0-4)
   deleted: (at driver6 s4)
   added: (at driver6 p0-4)
   goals met: 10 of 13
25. (walk driver6 p0-4 s0)
   deleted: (at driver6 p0-4)
   added: (at driver6 s0)
   goals met: 11 of 13
26. (drive-truck driver1 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 12 of 13
27. (disembark-truck driver1 s2 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 12 of 13
28. (walk driver1 s2 p2-3)
   deleted: (at driver1 s2)
   added: (at driver1 p2-3)
   goals met: 12 of 13
29. (walk driver1 p2-3 s3)
   deleted: (at driver1 p2-3)
   added: (at driver1 s3)
   goals met: 13 of 13
